{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1920, 1920, 3], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_28", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 7, "subsample": [2, 2], "init": "he_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "convolution2d_28"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_28", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "batchnormalization_28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "activation_31"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_12", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_31", 0, 0]]], "name": "maxpooling2d_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_29", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["maxpooling2d_12", 0, 0]]], "name": "convolution2d_29"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_29", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "batchnormalization_29"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_32"}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "activation_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_30", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["activation_32", 0, 0]]], "name": "convolution2d_30"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_30", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "batchnormalization_30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_33"}, "inbound_nodes": [[["batchnormalization_30", 0, 0]]], "name": "activation_33"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_13", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_33", 0, 0]]], "name": "maxpooling2d_13"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_23"}, "inbound_nodes": [[["maxpooling2d_13", 0, 0]]], "name": "dropout_23"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_31", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_23", 0, 0]]], "name": "convolution2d_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_39", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_23", 0, 0]]], "name": "convolution2d_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_47", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_23", 0, 0]]], "name": "convolution2d_47"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_31", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "batchnormalization_31"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_39", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_39", 0, 0]]], "name": "batchnormalization_39"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_47", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_47", 0, 0]]], "name": "batchnormalization_47"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_34"}, "inbound_nodes": [[["batchnormalization_31", 0, 0]]], "name": "activation_34"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_43"}, "inbound_nodes": [[["batchnormalization_39", 0, 0]]], "name": "activation_43"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_52"}, "inbound_nodes": [[["batchnormalization_47", 0, 0]]], "name": "activation_52"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_14", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_34", 0, 0]]], "name": "maxpooling2d_14"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_17", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_43", 0, 0]]], "name": "maxpooling2d_17"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_20", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_52", 0, 0]]], "name": "maxpooling2d_20"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_24"}, "inbound_nodes": [[["maxpooling2d_14", 0, 0]]], "name": "dropout_24"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_31"}, "inbound_nodes": [[["maxpooling2d_17", 0, 0]]], "name": "dropout_31"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_38"}, "inbound_nodes": [[["maxpooling2d_20", 0, 0]]], "name": "dropout_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_32", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_24", 0, 0]]], "name": "convolution2d_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_40", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_31", 0, 0]]], "name": "convolution2d_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_48", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_38", 0, 0]]], "name": "convolution2d_48"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_32", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "batchnormalization_32"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_40", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_40", 0, 0]]], "name": "batchnormalization_40"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_48", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_48", 0, 0]]], "name": "batchnormalization_48"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "name": "activation_35"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_44"}, "inbound_nodes": [[["batchnormalization_40", 0, 0]]], "name": "activation_44"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_53"}, "inbound_nodes": [[["batchnormalization_48", 0, 0]]], "name": "activation_53"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_25"}, "inbound_nodes": [[["activation_35", 0, 0]]], "name": "dropout_25"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_32"}, "inbound_nodes": [[["activation_44", 0, 0]]], "name": "dropout_32"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_39"}, "inbound_nodes": [[["activation_53", 0, 0]]], "name": "dropout_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_33", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_25", 0, 0]]], "name": "convolution2d_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_41", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_32", 0, 0]]], "name": "convolution2d_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_49", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_39", 0, 0]]], "name": "convolution2d_49"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_33", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "batchnormalization_33"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_41", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_41", 0, 0]]], "name": "batchnormalization_41"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_49", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_49", 0, 0]]], "name": "batchnormalization_49"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "name": "activation_36"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_45"}, "inbound_nodes": [[["batchnormalization_41", 0, 0]]], "name": "activation_45"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_54"}, "inbound_nodes": [[["batchnormalization_49", 0, 0]]], "name": "activation_54"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_15", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_36", 0, 0]]], "name": "maxpooling2d_15"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_18", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_45", 0, 0]]], "name": "maxpooling2d_18"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_21", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_54", 0, 0]]], "name": "maxpooling2d_21"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_26"}, "inbound_nodes": [[["maxpooling2d_15", 0, 0]]], "name": "dropout_26"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_33"}, "inbound_nodes": [[["maxpooling2d_18", 0, 0]]], "name": "dropout_33"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_40"}, "inbound_nodes": [[["maxpooling2d_21", 0, 0]]], "name": "dropout_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_34", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_26", 0, 0]]], "name": "convolution2d_34"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_42", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_33", 0, 0]]], "name": "convolution2d_42"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_50", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_40", 0, 0]]], "name": "convolution2d_50"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_34", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "batchnormalization_34"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_42", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_42", 0, 0]]], "name": "batchnormalization_42"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_50", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_50", 0, 0]]], "name": "batchnormalization_50"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_37"}, "inbound_nodes": [[["batchnormalization_34", 0, 0]]], "name": "activation_37"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_46"}, "inbound_nodes": [[["batchnormalization_42", 0, 0]]], "name": "activation_46"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_55"}, "inbound_nodes": [[["batchnormalization_50", 0, 0]]], "name": "activation_55"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_16", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_37", 0, 0]]], "name": "maxpooling2d_16"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_19", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_46", 0, 0]]], "name": "maxpooling2d_19"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_22", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_55", 0, 0]]], "name": "maxpooling2d_22"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_27"}, "inbound_nodes": [[["maxpooling2d_16", 0, 0]]], "name": "dropout_27"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_34"}, "inbound_nodes": [[["maxpooling2d_19", 0, 0]]], "name": "dropout_34"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_41"}, "inbound_nodes": [[["maxpooling2d_22", 0, 0]]], "name": "dropout_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_35", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [3, 3], "init": "he_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_27", 0, 0]]], "name": "convolution2d_35"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_43", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [3, 3], "init": "he_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_34", 0, 0]]], "name": "convolution2d_43"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_51", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [3, 3], "init": "he_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_41", 0, 0]]], "name": "convolution2d_51"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_35", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_35", 0, 0]]], "name": "batchnormalization_35"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_43", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_43", 0, 0]]], "name": "batchnormalization_43"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_51", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_51", 0, 0]]], "name": "batchnormalization_51"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_38"}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "name": "activation_38"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_47"}, "inbound_nodes": [[["batchnormalization_43", 0, 0]]], "name": "activation_47"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_56"}, "inbound_nodes": [[["batchnormalization_51", 0, 0]]], "name": "activation_56"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_28"}, "inbound_nodes": [[["activation_38", 0, 0]]], "name": "dropout_28"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_35"}, "inbound_nodes": [[["activation_47", 0, 0]]], "name": "dropout_35"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_42"}, "inbound_nodes": [[["activation_56", 0, 0]]], "name": "dropout_42"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_4", "trainable": true, "dim_ordering": "tf", "pool_size": [5, 5], "strides": [5, 5], "border_mode": "valid"}, "inbound_nodes": [[["dropout_28", 0, 0]]], "name": "averagepooling2d_4"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_5", "trainable": true, "dim_ordering": "tf", "pool_size": [5, 5], "strides": [5, 5], "border_mode": "valid"}, "inbound_nodes": [[["dropout_35", 0, 0]]], "name": "averagepooling2d_5"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_6", "trainable": true, "dim_ordering": "tf", "pool_size": [5, 5], "strides": [5, 5], "border_mode": "valid"}, "inbound_nodes": [[["dropout_42", 0, 0]]], "name": "averagepooling2d_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_36", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 1024, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["averagepooling2d_4", 0, 0]]], "name": "convolution2d_36"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_44", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 1024, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["averagepooling2d_5", 0, 0]]], "name": "convolution2d_44"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_52", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 1024, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["averagepooling2d_6", 0, 0]]], "name": "convolution2d_52"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_36", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_36", 0, 0]]], "name": "batchnormalization_36"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_44", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_44", 0, 0]]], "name": "batchnormalization_44"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_52", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_52", 0, 0]]], "name": "batchnormalization_52"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_39"}, "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "name": "activation_39"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_48"}, "inbound_nodes": [[["batchnormalization_44", 0, 0]]], "name": "activation_48"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_57"}, "inbound_nodes": [[["batchnormalization_52", 0, 0]]], "name": "activation_57"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_29"}, "inbound_nodes": [[["activation_39", 0, 0]]], "name": "dropout_29"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_36"}, "inbound_nodes": [[["activation_48", 0, 0]]], "name": "dropout_36"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_43"}, "inbound_nodes": [[["activation_57", 0, 0]]], "name": "dropout_43"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_37", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_29", 0, 0]]], "name": "convolution2d_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_45", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_36", 0, 0]]], "name": "convolution2d_45"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_53", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_43", 0, 0]]], "name": "convolution2d_53"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_37", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_37", 0, 0]]], "name": "batchnormalization_37"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_45", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_45", 0, 0]]], "name": "batchnormalization_45"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_53", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_53", 0, 0]]], "name": "batchnormalization_53"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_40"}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "name": "activation_40"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_49"}, "inbound_nodes": [[["batchnormalization_45", 0, 0]]], "name": "activation_49"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_58"}, "inbound_nodes": [[["batchnormalization_53", 0, 0]]], "name": "activation_58"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_30"}, "inbound_nodes": [[["activation_40", 0, 0]]], "name": "dropout_30"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_37"}, "inbound_nodes": [[["activation_49", 0, 0]]], "name": "dropout_37"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_44"}, "inbound_nodes": [[["activation_58", 0, 0]]], "name": "dropout_44"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_38", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 9, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_30", 0, 0]]], "name": "convolution2d_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_46", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 6, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_37", 0, 0]]], "name": "convolution2d_46"}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 4, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_54", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": true, "nb_filter": 10, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_44", 0, 0]]], "name": "convolution2d_54"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_38", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_38", 0, 0]]], "name": "batchnormalization_38"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_46", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_46", 0, 0]]], "name": "batchnormalization_46"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_54", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_54", 0, 0]]], "name": "batchnormalization_54"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_41"}, "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "name": "activation_41"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_50"}, "inbound_nodes": [[["batchnormalization_46", 0, 0]]], "name": "activation_50"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_59"}, "inbound_nodes": [[["batchnormalization_54", 0, 0]]], "name": "activation_59"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["activation_41", 0, 0]]], "name": "flatten_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}, "inbound_nodes": [[["activation_50", 0, 0]]], "name": "flatten_5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}, "inbound_nodes": [[["activation_59", 0, 0]]], "name": "flatten_6"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_42"}, "inbound_nodes": [[["flatten_4", 0, 0]]], "name": "activation_42"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_51"}, "inbound_nodes": [[["flatten_5", 0, 0]]], "name": "activation_51"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_60"}, "inbound_nodes": [[["flatten_6", 0, 0]]], "name": "activation_60"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["activation_42", 0, 0], ["activation_51", 0, 0], ["activation_60", 0, 0]], "name": "model_2"}}