{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_61", "epsilon": 0.001, "trainable": true, "mode": 0, "input_dtype": "float32", "batch_input_shape": [null, 25], "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_61", "output_dim": 8, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 25, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 25]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_62", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_46"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_62", "output_dim": 4, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 8, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 8]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_63", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_47"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_63", "output_dim": 4, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 4, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 4]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_64", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_48"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_64", "output_dim": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 4, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "batch_input_shape": [null, 4]}}]}